[
{"type":"header","version":"4.9.1","comment":"Export to JSON plugin for PHPMyAdmin"},
{"type":"database","name":"capstone"},
{"type":"table","name":"course","database":"capstone","data":
[
{"course_id":"102120","course_name":"Computer Skills","course_description":"This course provides a foundational understanding of essential computer skills necessary for success in today's digital age. Participants will gain hands-on experience with fundamental concepts and tools that form the backbone of computer literacy. The course covers a range of topics designed to empower students with practical skills for navigating and utilizing computer systems effectively.","pre_requisite":"None","post_requisite":"Introduction to Programming\r\nFoundations of Software Engineering","course_major":"Computer Science"},
{"course_id":"102220","course_name":"Introduction to Programming","course_description":"This course introduces principles of computer programming using Java as a programming \r\nlanguage. The course introduces the concept of algorithms and trains students to compile, \r\nrun and debug java programs. Also, the course includes topics such as simple data types; \r\noperators and expressions; variables; input and output; control structures (conditional and \r\nrepetition statements); methods; libraries; arrays and some of their applications.","pre_requisite":"Computer Skills","post_requisite":"Object-Oriented Programming","course_major":"Computer Science"},
{"course_id":"102221","course_name":"Object-Oriented Programming ","course_description":"This course provides students with deep understanding of object oriented programming \r\nconcepts. Topics covered include classes, objects, Instantiation, methods, and instance \r\nvariables, I\/O, encapsulation, static fields and static methods, overloading, constructors, \r\nscope of declarations, overriding, composition, Java API packages, inheritance, garbage \r\ncollection, polymorphism, final methods and final classes abstract classes and methods, \r\ninterfaces, and introduction to GUI.","pre_requisite":"Introduction to Programming ","post_requisite":"Data Structures and Algorithms \r\nDatabase System\r\nObject-Oriented Analysis and Design","course_major":"Computer Science"},
{"course_id":"102240","course_name":"Computer Organization","course_description":"This course introduces the fundamentals of computer organization and machine \r\narchitecture. It covers logical components and circuits, data representations, register \r\ntransfer, bus and memory transfers, arithmetic microoperations, logic microoperations \r\nand shift microoperations, instruction codes, registers, common bus system, timing and \r\ncontrol, instruction cycle, register-reference instructions, memory-reference instructions, \r\nI\/O instructions","pre_requisite":"Discrete Structures","post_requisite":"Operating Systems ","course_major":"Computer Science "},
{"course_id":"102270","course_name":"Data Structures and Algorithms","course_description":"This course introduces the main concepts of data structures and algorithms. Topics covered: \r\nconcepts of Abstract Data Types (ADT), specification of different ADT structures such as: \r\n(Bags, Lists, Stacks, Trees and Graphs), Array and Linked Data implementations of these \r\nADTs using object oriented approach, and analyzing algorithm’s efficiency in term of time and \r\nspace storage. In addition, the course will introduce recursion as simple technique for solving \r\ncomplex problems and a detailed comparison of various sorting and searching algorithms.","pre_requisite":"Object-Oriented Programming\r\nDiscrete Structures","post_requisite":"Design and Analysis of Algorithms \r\nIntroduction to Computer Graphics ","course_major":"Computer Science"},
{"course_id":"102308","course_name":"Introduction to Artificial Intelligence","course_description":"This course serves as an introduction to the field of Artificial Intelligence (AI), covering foundational concepts, techniques, and applications. Students will explore the principles behind AI, various problem-solving approaches, and gain hands-on experience with AI tools and programming. The course provides a broad understanding of AI's capabilities, challenges, and its impact on diverse domains.","pre_requisite":"Data Structures and Algorithms ","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102330","course_name":"Database Systems","course_description":"This course introduces the basic concepts of databases, which include database system \r\narchitecture; entity-relationship model; hierarchical, network, and relational data models; \r\nfunctional dependencies and normal forms. Design, implementation, and optimization of \r\nSQL query languages with basic relational algebra; and security and integrity.","pre_requisite":"Object-Oriented Programming","post_requisite":"Web Development","course_major":"Computer Science"},
{"course_id":"102331","course_name":"System Analysis & Design","course_description":"This course introduces the object-oriented analysis design using Unified Modeling Language (UML), which includes the unified process development cycle; use case analysis; dynamic and static diagrams","pre_requisite":"Foundations of Software Engineering","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102340","course_name":"Operating Systems","course_description":"This course covers the basics of operating system concepts starting from its history. The \r\ncourse covers the Processes including process and threads scheduling, inter-process \r\ncommunication, critical section problem, and CPU scheduling It also covers the concepts \r\nof Input\/output including principles of I\/O hardware and software, disk arm scheduling and \r\ndeadlocks; Memory management including swapping, paging, virtual memory and page \r\nreplacement algorithms; File systems including File system structures, access, protection \r\nand i-nodes. Some examples of operating systems will be introduced.","pre_requisite":"Computer Organization ","post_requisite":"Security of Information Systems","course_major":"Computer Science"},
{"course_id":"102341","course_name":"Formal Languages and Automata Theory","course_description":"The course introduces fundamental concepts in automata theory and formal languages including finite automata (deterministic and non-deterministic finite accepters), regular expressions, regular grammar, regular and non-regular languages, pushdown automata, context-free languages and Turing machine.\r\n","pre_requisite":"Discrete Structures","post_requisite":"Introduction to Compilers ","course_major":"Computer Science"},
{"course_id":"102370","course_name":"Design and Analysis of Algorithms","course_description":"This course provides a comprehensive introduction to the design and analysis of algorithms, with a focus on developing efficient and effective problem-solving strategies. Students will explore various algorithmic techniques, learn how to analyze their efficiency, and gain practical experience in implementing algorithms. The course aims to equip students with the skills necessary to design algorithms for a wide range of problems and understand their performance characteristics.","pre_requisite":"Data Structures and Algorithms\r\nDiscrete Structures ","post_requisite":"Data and Web Mining","course_major":"Computer Science"},
{"course_id":"102420","course_name":"Web Development","course_description":"This course introduces the basics programming and scripting languages for the Web \r\ndevelopment. It covers basic concepts of the World Wide Web (WWW), HTML 5, CSS \r\n4, JavaScript 1.8, XML, and PHP 7.","pre_requisite":"Database Systems","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102421","course_name":"Introduction to Compilers","course_description":"This course introduces students to the fundamental concepts of compilers. It covers compiler architectures, data types and representation, grammatical production process, properties of grammars, grammar formalism, lexical analysis, lexical versus syntactic \r\nanalysis, creating a lexical analyzer, transition table compression, symbol tables, bottom up parsing, top-down parsing, exception handling, Symantec analysis, code generation, preprocessing the intermediate code, optimization techniques, general optimization, code \r\nsize reduction, and power reduction and energy saving.","pre_requisite":"Formal Languages and Automata Theory ","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102450","course_name":"Computer Networks ","course_description":"This course introduces computer network uses, computer network components and \r\nclassifications. Further this course covers computer network architectures, network \r\nLayers; network access; physical layer and data link layer, network layer, transport layer \r\nand application layer. Furthermore, the course will introduce IP Addressing, sub-netting and \r\ncomputer network security.","pre_requisite":"Digital Logic Design","post_requisite":"Cryptography & Computer Network Security\r\nEmerging Technologies IoT and Cloud\r\nEthical Hacking ","course_major":"Computer Science"},
{"course_id":"102452","course_name":"Security of Information Systems","course_description":"This course is designed to provide students with a comprehensive understanding of the principles, techniques, and best practices related to the security of information systems. With an increasing reliance on digital technologies and the interconnected nature of modern systems, the protection of sensitive information and the resilience of information systems against cyber threats have become critical. This course covers a range of topics, from the fundamentals of information security to advanced concepts in securing complex IT infrastructures.","pre_requisite":"Operating Systems","post_requisite":"None ","course_major":"Cybersecurity"},
{"course_id":"102453","course_name":"Computer Ethics","course_description":"This course addresses a definition of ethics, provides a framework for making ethical \r\ndecisions, and analyzes in detail several areas of ethical issues that computer professionals \r\nare likely to encounter in the workplace. Topics include philosophical, business and \r\nprofessional ethics, software reliability, intellectual property, copyrights, privacy, data \r\nmining, and computer security","pre_requisite":">=60 CR.H.\r\n","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102460","course_name":"Introduction to Computer Graphics","course_description":"This course introduces basic concepts of computer graphics. It includes graphics \r\ngeometry, primitives, two- and three-dimensional representations. It also covers geometric \r\ntransformations, window clipping, and computer animation. OpenGL is used to illustrate the \r\ntechniques and algorithms covered in the course.","pre_requisite":"Linear Algebra\r\nData Structures and Algorithms ","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102480","course_name":"Simulation and Modeling","course_description":"This course covers Modeling and Simulation Process principles; data collection and analysis; Monte Carlo simulation; event scheduling; dealing with uncertainty; confidence intervals; Terminating and steady state analysis; and Input Distribution Modeling. The \r\ncourse will use MATLAB to conduct the modeling and simulation techniques and learned algorithms. ","pre_requisite":"Probability Theory and Statistics\r\nIntroduction to Programming \r\n","post_requisite":"None","course_major":"Computer Science "},
{"course_id":"102481","course_name":"Data and Web Mining","course_description":"The course introduces principles and techniques of (Web) data mining. Topics include: \r\ndifferent data mining techniques such as classification, prediction, clustering and reasoning. \r\nThe course goes through the cycle of data mining starting from collecting the data all the \r\nway to evaluating and interpretation the results. Some challenges are covered that are \r\nconcern with Web data mining in particular such as data integration for e-commerce, Web \r\ndata warehousing, and Web personalization and recommender systems. The course will use \r\nWeka as a data mining tool.","pre_requisite":"Design and Analysis of Algorithms ","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102490","course_name":"CS Internship","course_description":"This course provides real world experience in Computer Science field. The\r\ninternship must be off-campus and students must complete at least one semester of work consisting of 640 hours \r\n","pre_requisite":">= 75 CR.H.\r\n","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"102491","course_name":"CS Capstone Project 1","course_description":"A project that involves a significant design and implementation, and satisfies AAU senior project requirement and the Computer Science design requirement.","pre_requisite":">=90 CR.H.+ Dept. Approval\r\n","post_requisite":"CS Capstone Project 2","course_major":"Computer Science "},
{"course_id":"102492","course_name":"CS Capstone Project 2","course_description":"A project that involves a significant design and implementation, and satisfies AAU senior project requirement and the Computer Science design requirement.","pre_requisite":"CS Capstone Project 1","post_requisite":"None","course_major":"Computer Science "},
{"course_id":"103220","course_name":"Foundations of Software Engineering","course_description":"This course introduces basic concepts of software engineering by focusing on software \r\nengineering process: development and maintenance. The course covers the software \r\nengineering lifecycle models and deliverables; requirements analysis and specification; \r\narchitectural and detailed design; verification and validation and software maintenance issues.\r\n","pre_requisite":"Computer Skills","post_requisite":"Software Requirements and Specification\r\nSoftware Project Management \r\nUser Interface Design ","course_major":"Software Engineering "},
{"course_id":"103320","course_name":"Software Requirements and Specification","course_description":"This course introduces requirements engineering within software life-cycle: requirements \r\nelicitation and modeling issues and techniques; documentation and management of \r\nrequirements; standards and CASE tools; cognitive and socio-organizational issues","pre_requisite":"Foundations of Software Engineering ","post_requisite":"Software Design and Development \r\nFormal Specifications and Design Methods ","course_major":"Software Engineering "},
{"course_id":"103330","course_name":"Software Design and Development","course_description":"The Software Design and Development course is designed to teach students the knowledge, \r\nunderstanding, skills and values to solve problems through the creation of software solutions. \r\nThe course introduces students to the nature of software design, design process, agile-based \r\ndesign, architectural design and distributed architecture. It also introduces popular design \r\nframeworks, such as object-oriented design, function-oriented design, and aspect-oriented \r\ndesign. The course is concluded with user interface design and its contemporary design issues.","pre_requisite":"Software Requirements and Specification ","post_requisite":"Object-Oriented Analysis and Design\r\nSoftware Measurement and Testing\r\nSecure Software Engineering","course_major":"Software Engineering "},
{"course_id":"103331","course_name":"Formal Specifications and Design Methods","course_description":"Complex and large software system often have complicated control structures involving \r\nconcurrency and real-time interactions, which makes their development a challenging task. \r\nOne of the best method of developing these kind of systems is using mathematical and logical \r\ntools (so-called formal methods). In this course, we will study formal methods in detail and \r\ntheir usage in requirements specification and software design.","pre_requisite":"Software Requirements and Specification\r\nDiscrete Structures ","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"103420","course_name":"Software Project Management","course_description":"This course develops the basic principles of project management, including concepts from \r\nthe initiating, planning, executing, monitoring & controlling, and closing process groups. \r\nIntroduces fundamentals from the ten project management knowledge areas: integration, \r\nscope, time, cost, quality, human resources, communications management","pre_requisite":"Foundations of Software Engineering ","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"103430","course_name":"Object-Oriented Analysis and Design","course_description":"This course introduces the object-oriented analysis and design, which includes the \r\nUnified Process development cycle; object oriented principles (encapsulation, inheritance, \r\npolymorphism), use case analysis; Unified Modeling Language (UML), dynamic and static \r\ndiagrams; design principles (coupling and cohesion) and design patterns. The course \r\nincludes a large-scale software-development project.","pre_requisite":"Object-Oriented Programming\r\nSoftware Design and Development","post_requisite":"Agent-Based Modelling","course_major":"Software Engineering "},
{"course_id":"103431","course_name":"User Interface Design","course_description":"In this course, students will learn principles of designing, developing and testing appealing \r\nand effective user interface (UI) and user experience (UX) for desktop, web and mobile \r\napplications. They will learn about UI and UX design patterns, usability testing, and learnability. \r\nIssues and guidelines of designing modern and contemporary interfaces of small screened \r\ndevices, such as Android and iPhone, will also be part of the course. The growing field of Big \r\ndata demands effective data visualization on modern devices. We will learn methods and best \r\npractices to present such information in an effective manner on the applications along with \r\ncreation and testing of modern Dashboards","pre_requisite":"Foundations of Software Engineering","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"103432","course_name":"Agent-Based Modelling","course_description":"Agent-Based Modeling (ABM) is a computational modeling technique used to simulate complex systems by representing individual entities, known as agents, and their interactions within a given environment. These agents can be anything from individuals, groups, or even abstract entities, and they typically have specific behaviors, attributes, and rules governing their interactions.","pre_requisite":"Object-Oriented Analysis and Design","post_requisite":"None","course_major":"Software Engineering"},
{"course_id":"103440","course_name":"Software Measurement and Testing","course_description":"This course is an introduction to software testing and metrics within the context of software \r\nquality engineering: module and unit testing; integration and acceptance testing; quality \r\nfactors and metrics; verification and validation; review and inspections; reliability, security \r\nand safety assurance; and automated software testing","pre_requisite":"Software Design and Development","post_requisite":"Software Evolution and Maintenance","course_major":"Software Engineering "},
{"course_id":"103441","course_name":"Software Evolution and Maintenance","course_description":"This course provides concepts and advanced technologies in software evolution: Program \r\ncomprehension; construction of reusable software; separation of concerns; techniques for \r\nreverse engineering and re-engineering software; design for change layered design and \r\nincremental; and also analyze an existing system, explore possible change strategies, and \r\nconstruct a plan for evolving each of the systems major components.","pre_requisite":"Software Measurement and Testing","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"103443","course_name":"Secure Software Engineering","course_description":"This course provides a comprehensive exploration of principles, methodologies, and practices in secure software engineering. With a focus on building resilient and secure software systems, students will learn the fundamentals of secure software design, development, and testing. The course emphasizes identifying and mitigating security vulnerabilities throughout the software development lifecycle.","pre_requisite":"Software Design and Development","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"103480","course_name":"SE Internship","course_description":"This course provides real world experience in Software Engineering field. The internship must be off-campus and students must complete at least one semester of work consisting of 640 hours \r\n","pre_requisite":">= 75 CR.H.","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"103490","course_name":"SE Capstone Project1","course_description":"A project that involves a significant design and implementation, \r\nand satisfies AAU senior project requirement and the Software Engineering design requirement.","pre_requisite":">=90 CR.H.+Dept. Approval\r\n","post_requisite":"SE Capstone Project2","course_major":"Software Engineering "},
{"course_id":"103491","course_name":"SE Capstone Project2 ","course_description":"A project that involves a significant design and implementation, \r\nand satisfies AAU senior project requirement and the Software Engineering design requirement.","pre_requisite":"SE Capstone Project1","post_requisite":"None","course_major":"Software Engineering "},
{"course_id":"104230","course_name":"Circuit Analysis I","course_description":"This course is an introduction to linear circuit analysis. Topics include Ohm’s law; Kirchhoff’s \r\nlaws; resistor combinations; nodal and loop analysis techniques; superposition theorem; \r\nsource transformation; Thevenin’s and Norton’s theorems; maximum power transfer; \r\ncapacitance and inductance; first- and second-order transient analysis","pre_requisite":"Physics II ","post_requisite":"Circuit Analysis Lab\r\nCircuit Analysis II\r\nElectronic Circuits","course_major":"Computer Engineering"},
{"course_id":"104231","course_name":"Circuit Analysis Lab","course_description":"The Circuit Analysis Lab is a hands-on, practical exploration of fundamental electrical circuits to complement theoretical concepts learned in circuit analysis courses. This laboratory course is designed to provide students with a comprehensive understanding of the principles and techniques used in the analysis and design of electrical circuits.","pre_requisite":"Circuit Analysis I ","post_requisite":"None","course_major":"Computer Engineering"},
{"course_id":"104240","course_name":"Digital Logic Design","course_description":"This course presents the theory of number systems, binary arithmetic, Boolean algebra, digital \r\ncircuits and systems, stressing techniques for the analysis and synthesis of combinational \r\nand sequential logic systems","pre_requisite":"Discrete Structures ","post_requisite":"Computer Networks\r\n","course_major":"Computer Engineering"},
{"course_id":"104241","course_name":"Digital Logic Design Lab","course_description":"The Digital Logic Design Lab offers a practical and hands-on approach to reinforce concepts introduced in digital logic design courses. This laboratory course is designed to provide students with a comprehensive understanding of digital circuits, logic gates, and sequential and combinational logic. ","pre_requisite":"Digital Logic Design","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"104330","course_name":"Circuit Analysis II","course_description":"This course covers sinusoidal steady-state circuit analysis including phasors, impedance, \r\nadmittance and analysis techniques; steady-state power analysis including instantaneous, \r\naverage, and complex power; mutual inductance and transformers; frequency response; \r\nresonant circuits; passive filters; and two-port networks.","pre_requisite":"Circuit Analysis I ","post_requisite":"Electromagnetic Theory","course_major":"Computer Engineering"},
{"course_id":"104331","course_name":"Electronic Circuits","course_description":"This course covers diode circuits and applications; Field-Effect Transistors (FET) and \r\nBipolar Junction Transistors (BJT); DC biasing of amplifiers; small signal models for \r\ntransistors; the types of single-stage amplifiers; and multistage amplifiers","pre_requisite":"Circuit Analysis I ","post_requisite":"Electronics Lab \r\nCommunication Circuits","course_major":"Computer Engineering"},
{"course_id":"104332","course_name":"Electronics Lab","course_description":"The Electronics Lab is a hands-on laboratory course designed to complement theoretical knowledge in electronics and provide students with practical skills in the design, analysis, and implementation of electronic circuits. This course covers a range of topics in electronics, emphasizing both analog and digital circuitry","pre_requisite":"Electronic Circuits","post_requisite":"None","course_major":"Computer Engineering"},
{"course_id":"104333","course_name":"Digital Electronics","course_description":"This course discusses digital design techniques for integrated circuits. Emphasis is on the \r\ndesign of logic gates and circuits at the transistor level. A number of different logic families \r\nare described, including CMOS, ECL and TTL","pre_requisite":"Electronic Circuits \r\nDigital Logic Design","post_requisite":"VLSI Systems Design","course_major":"Computer Engineering "},
{"course_id":"104340","course_name":"Computer Architecture","course_description":"The Computer Architecture course offers a comprehensive exploration of the fundamental principles, design methodologies, and organization of computer systems. This course delves into the architecture and components that constitute the foundation of modern computing devices. ","pre_requisite":"Computer Organization ","post_requisite":"Advanced Computer Architecture","course_major":"Computer Engineering  "},
{"course_id":"104350","course_name":"Microprocessor and Assembly Language","course_description":"This course covers: the architecture of the microprocessor, microprocessor instructions, assembly language, basic I\/O and memory interfaces.","pre_requisite":"Computer Organization ","post_requisite":"None","course_major":"Computer Engineering"},
{"course_id":"104351","course_name":"Microprocessor and Assembly Language Lab","course_description":"The Microprocessor and Assembly Language Lab is a hands-on, practical laboratory course designed to complement theoretical concepts in microprocessor architecture and assembly language programming. This course provides students with the opportunity to gain practical experience in working with microprocessors, understanding their architecture, and writing assembly language programs. ","pre_requisite":"Microprocessor and Assembly Language","post_requisite":"None ","course_major":"Computer Engineering "},
{"course_id":"104352","course_name":"Control Systems","course_description":"The Control Systems course provides students with a comprehensive understanding of the principles, analysis, and design of control systems used in engineering applications. The course covers both classical and modern control techniques, emphasizing their applications in various engineering disciplines. ","pre_requisite":"Signals and Systems Analysis ","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"104430","course_name":"VLSI Systems Design","course_description":"This course introduces VLSI design in CMOS technology, and provides a background on \r\nCMOS layout and physical design. The theory of MOS transistors is addressed along with \r\ncharacterization and performance estimation of CMOS circuits. In addition, the course \r\ncovers array subsystems including decoders and memory systems, and provides an \r\nintroduction to Verilog and VHDL to be used to design and simulate a finite state machine. \r\nLab sessions are required.","pre_requisite":"Digital Electronics ","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"104440","course_name":"Digital Systems Design","course_description":"This course covers the concepts of sequential logic including Finite State Machine \r\n(FSM) models (Mealy and Moore), state transition tables and state diagrams. The course \r\naddresses FSM implementation with D and JK flip-flops, and design issues with regard \r\nof state reduction in FSMs and incompletely specified sequential circuits. The topic of \r\nAlgorithmic State Machines (ASMs) is also addressed as well as asynchronous circuits \r\nand hazards. Throughout this course, the students learn a Hardware Description Language \r\nsuch as VHDL or Verilog to be used in designing with programmable logic (e.g. PLD, ROM, \r\nFPGA.) Lab sessions are required.","pre_requisite":"Computer Organization ","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"104441","course_name":"Advanced Computer Architecture","course_description":"This course covers advanced concepts in computer architecture. Topics include \r\ninstruction set architecture, pipelining, instruction-level parallelism, caches and \r\nvirtual memory design, input\/output systems, multiprocessors, and SIMD","pre_requisite":"Computer Architecture","post_requisite":"None ","course_major":"Computer Engineering "},
{"course_id":"104450","course_name":"Embedded Systems","course_description":"Basic architecture and assembly language of a microcontroller, Principles of microprocessor \r\nserial and parallel interfacing, Counters, Timers, ADC and DAC relevant chips, Software \r\nand hardware interrupt handling routines, Data acquisition, Human and physical interfaces, \r\nApplication of top-down design to microcontroller software development in assembly language \r\nand a high level language, Evaluation of hardware and software trade-offs.","pre_requisite":"Microprocessor and Assembly Language ","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"104580","course_name":"CE Internship","course_description":"This course provides real world experience in Computer Engineering field. The internship must be off-campus and students must complete at least one semester of work consisting of 640 hours","pre_requisite":">= 75 CR.H.\r\n","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"104590","course_name":"CE Capstone Project I","course_description":"A project that involves a significant design and implementation, and satisfies AAU senior project requirement and the Computer Engineering design requirement.","pre_requisite":"100CR.H.","post_requisite":"CE Capstone Project II ","course_major":"Computer Engineering "},
{"course_id":"104591","course_name":"CE Capstone Project II","course_description":"A project that involves a significant design and implementation, and satisfies AAU senior project requirement and the Computer Engineering design requirement.","pre_requisite":"CE Capstone Project I ","post_requisite":"None","course_major":"Computer Engineering "},
{"course_id":"105400","course_name":"Computer Network Protocols ","course_description":"This course introduces concepts and principles in today’s networks and various aspects of computer networking, including layered network architecture, TCP\/IP suite, client-server and P2P paradigms, application layer protocols application layer protocols (e.g. HTTP, FTP, SMTP, POP3, IMAP, and DNS), packet delay, packet loss, throughput in packet switched networks, transport layer protocols (TCP\/UDP), reliable data transfer, flow control and congestion control, IPv4\/IPv6 addressing, subnetting, CIDR, IP packet delivery and routing, Internet Control Message Protocol (ICMP), Dijkstra algorithm, OSPF, RIP, BGP.\r\n","pre_requisite":"Data & Computer Communications\r\nProbability Theory and Statistics ","post_requisite":"Network Lab\r\nComputer Network Management\r\nCryptography and Computer Network Security\r\nNetwork Programming\r\nEmerging Wireless Networking  ","course_major":"Networks and Communication Engineering "},
{"course_id":"105401","course_name":"Network Lab","course_description":"The Network Lab is a hands-on laboratory course designed to provide students with practical experience in the design, implementation, and troubleshooting of computer networks. This course complements theoretical knowledge gained in networking courses and aims to equip students with the skills necessary for planning, configuring, and maintaining network infrastructures. ","pre_requisite":"Computer Network Protocols","post_requisite":"Computer Network Management ","course_major":"Networks and Communication Engineering"},
{"course_id":"105411","course_name":"Computer Network Management","course_description":"Introduction to methods, techniques and tools for the management of computer networks. \r\n","pre_requisite":"Computer Network Protocols\r\nNetwork Lab\r\n","post_requisite":"None","course_major":"Networks and Communication Engineering"},
{"course_id":"105420","course_name":"Network Programming","course_description":"This course introduces the students to the basic concepts of networks programming using Java programming language and its network libraries. The course covers the TCP\/IP protocol stack, Internet Addressing and URL, Client-Server Model, Peer-to-Peer Model , I\/O Streams, TCP Sockets, UDP Sockets, Multithreading and Multiplexing, Secure sockets, File Handling, Non-Blocking I\/O, RMI, CORBA, Servlets, and Web Services.","pre_requisite":"Object-Oriented Programming\r\nComputer Network Protocols","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"105422","course_name":"Emerging Wireless Networking","course_description":"The Emerging Wireless Networking course is designed to provide students with a comprehensive understanding of the latest advancements and emerging trends in wireless networking technologies. As an extension of traditional networking courses, this advanced-level class focuses on cutting-edge developments in wireless communication, network protocols, and applications.","pre_requisite":"Introduction to Communication Systems \r\nComputer Network Protocols ","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"106320","course_name":"Data & Computer Communications","course_description":"This course provides an overview of data communication and networks. Topics include: Network topologies, Network models and devices, Data transmission and mediums, Multiplexing, Signal encoding, Error detection and correction techniques, Physical and Data \r\nLink Control layers’ issues.","pre_requisite":"Digital Logic Design ","post_requisite":"Computer Network Protocols ","course_major":"Networks and Communication Engineering"},
{"course_id":"106330","course_name":"Signals and Systems Analysis","course_description":"This course covers the followings topics: Continuous- and discrete- time signals and system, Continuous and discrete linear time-invariant systems. Fourier Analysis: Fourier series and Fourier Transform. Laplace Transform and Z- transform.","pre_requisite":"Engineering Math ","post_requisite":"Probability and Random Processes\r\nIntroduction to Communication Systems\r\nDigital Signal Processing  ","course_major":"Networks and Communication Engineering"},
{"course_id":"106331","course_name":"Probability and Random Processes","course_description":"This course includes discussion of probabilistic models, conditional probability; vectors of random variables; distributions and density functions; expectations and characteristic \r\nfunctions; independence; laws of large numbers; central-limit theorem; random process concepts; random signal analysis concepts","pre_requisite":"Signals and Systems Analysis \r\nProbability Theory and Statistics\r\n","post_requisite":"Digital Communication ","course_major":"Networks and Communication Engineering"},
{"course_id":"106340","course_name":"Introduction to Communication Systems","course_description":"This course includes a review of signals, linear systems and Fourier theory, signals bandwidth and spectra, an analysis of analogue modulation systems (AM, PM and FM), synchronizations, characterization and effect of noise, transceiver architectures of analog \r\nsystems, and overview of pulse code modulation","pre_requisite":"Signals and Systems Analysis","post_requisite":"Digital Communication \r\nEmerging Wireless Networking\r\nCommunication Circuits","course_major":"Networks and Communication Engineering "},
{"course_id":"106341","course_name":"Communications Lab","course_description":"The Communications Lab is a hands-on, practical laboratory course designed to complement theoretical concepts in communication systems and provide students with essential skills in designing, implementing, and analyzing communication technologies. The course encompasses various aspects of communication, including analog and digital signals, modulation techniques, and transmission protocols. ","pre_requisite":"Digital Communication ","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"106350","course_name":"Electromagnetic Theory","course_description":"This course introduces the basic concepts and mathematics of the classical \r\nElectromagnetic Theory. Topics include vector algebra, coordinate systems, a \r\ndiscussion of static electric field dielectrics, polarization, field distributions of \r\ncharges, steady electric currents, field at boundary conditions, and Maxwell’s \r\nequations. Prior knowledge of vector calculus, differential equation and \r\nundergraduate level electromagnetic theory is required.","pre_requisite":"Calculus II\r\nCircuit Analysis II","post_requisite":"Antennas ","course_major":"Networks and Communication Engineering"},
{"course_id":"106430","course_name":"Digital Signal Processing","course_description":"This course includes a review of discrete-time signals and systems properties \r\nand representation, sampling of continues time signals. The course will cover \r\ndigital processing of continuous-time signals, a review of Z-transform, frequency \r\nresponse and impulse response for linear time invariant systems. It also covers the \r\ndesign of Finite impulse response (FIR) filters and infinite impulse response (IIR) \r\nfilters. Discrete Fourier Series and Discrete Fourier Transform (DFT). Fast Fourier \r\nTransform (FFT). Fourier analysis of signals using Discrete Fourier Transform.\r\n","pre_requisite":"Signals and Systems Analysis","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"106440","course_name":"Digital Communication","course_description":"This course reviews probability, random variables and signal representation. It \r\nalso introduces the power and energy analysis for signals using time domain and \r\nfrequency domain. The course introduces the concept of data formatting, sampling \r\ntheory, Nyquist Criteria, uniform and non-uniform quantization, digital Modulation\/\r\nDemodulation techniques for baseband and band-pass signals, Inter-symbol interference (ISI) and Equalization channel coding\/decoding methods and technique","pre_requisite":" Introduction to Communication Systems \r\nProbability and Random Processes ","post_requisite":"Communications Lab\r\nWireless Communication Fundamentals","course_major":"Networks and Communication Engineering "},
{"course_id":"106441","course_name":"Wireless Communication Fundamentals","course_description":"This course covers: Transmission fundamentals; RF wave propagation, Channel characterization, Multiple Access techniques; Spread spectrum; Wireless cellular \r\nconcepts.","pre_requisite":"Digital Communication","post_requisite":"None","course_major":" Networks and Communication Engineering "},
{"course_id":"106442","course_name":"Communication Circuits","course_description":"The Communication Circuits course is designed to provide students with a thorough understanding of the fundamental principles, design techniques, and applications of electronic circuits in communication systems. Emphasizing both analog and digital communication, the course explores the theory and practical aspects of circuits essential for modern communication technologies.","pre_requisite":"Electronic Circuits\r\nSignals and Systems Analysis","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"106450","course_name":"Antennas","course_description":"The course introduces the fundamental principles of antenna theory and \r\nelectromagnetic radiation. Topics include: Antenna parameters; Radiation \r\nIntegrals; Dipole and Loop antennas; Travelling-wave antennas; Aperture and \r\nMicrostrip patch antennas; Linear and planar antenna arrays.","pre_requisite":"Electromagnetic Theory","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"106580","course_name":"NE Internship","course_description":"This course provides real world experience in Networks and communication Engineering field. The internship must be off-campus and students must complete at least one semester of work consisting of 640 hours","pre_requisite":">= 75 CR.H.","post_requisite":"None","course_major":"Networks and Communication Engineering"},
{"course_id":"106590","course_name":"Capstone Project I","course_description":"A project that involves a significant design and implementation, \r\nand satisfies AAU senior project requirement and the Networks and Communication Engineering design \r\nCapstone II requirement.","pre_requisite":"100CR.H.\r\n","post_requisite":"Capstone Project II","course_major":"Networks and Communication Engineering"},
{"course_id":"106591","course_name":"Capstone Project II","course_description":"A project that involves a significant design and implementation, \r\nand satisfies AAU senior project requirement and the Networks and Communication Engineering design \r\nCapstone II requirement.","pre_requisite":"Capstone Project I ","post_requisite":"None","course_major":"Networks and Communication Engineering"},
{"course_id":"107101","course_name":"Calculus I","course_description":"Topics in this course include a brief review of functions, foundation of trigonometry functions \r\nand its graphs, Limits and continuity, the concept and methods of Differentiation, curve \r\nsketching, maximum-minimum problems, related rates, Mean Value Theorem, the concept of \r\nanti-derivative, Riemann integral, logarithm, and exponential functions","pre_requisite":"None","post_requisite":"Linear Algebra \r\nProbability Theory and Statistics \r\nCalculus II ","course_major":"Computer Science"},
{"course_id":"107102","course_name":"Linear Algebra","course_description":"Linear equations, Gaussian elimination, Matrices, Algebraic properties of matrix operations, \r\ndeterminants, vector spaces, subspaces, basis and dimensions, Linear dependence and \r\nindependence, Linear transformations, eigenvalues and eigenvectors.","pre_requisite":"Calculus I ","post_requisite":"Introduction to Numerical Methods \r\nIntroduction to Computer Graphics","course_major":"Computer Science"},
{"course_id":"107103","course_name":"Probability Theory and Statistics","course_description":"This course covers the fundamental principle of probability, discrete probability \r\ndistributions and continuous (i.e. normal) distribution. Also, this course covers a \r\nprogression of topics from introduction to statistics, constructing and interpreting \r\ngraphs, measures of central tendency, measures of dispersion (or variation), \r\nmeasures of position, linear regression and correlation analysis and estimating \r\nsingle population parameters (confidence interval estimation). Applications and \r\nproblem solving are emphasized.","pre_requisite":"Calculus I ","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"107104","course_name":"Calculus II","course_description":"This course covers the following topics: applications of definite integrals to calculate \r\nvolumes and lengths of plane curves, and area of surfaces of revolution, techniques \r\nof integration, first order differential equations, infinite sequences and series, power \r\nseries, parametric equations, polar coordinates, vectors and the geometry of space.","pre_requisite":"Calculus I","post_requisite":"Introduction to Numerical Methods","course_major":"Computer Science"},
{"course_id":"107200","course_name":"Discrete Structures ","course_description":"The course covers how to formulate and represent problems mathematically, think logically \r\nand apply mathematical techniques for solving such problems. To this end, students will learn \r\nlogic and proof, sets, functions, induction and recursion. The course will also cover some \r\ncombinatorial principles and methods such as counting, permutation and combination. Key \r\ntopics involving discrete probability, Boolean algebra, graphs and trees are also covered","pre_requisite":"None","post_requisite":"Data Structures and Algorithms\r\nFormal Specifications and Design Methods\r\nDesign and Analysis of Algorithms \r\nComputer Organization","course_major":"Computer Science"},
{"course_id":"107201","course_name":"Introduction to Numerical Methods","course_description":"This course provides an overview of the practical experience in utilizing algorithms \r\nfor solving numerical problems arising in applied sciences. Topics covered will \r\ninclude solution of linear and nonlinear systems, curve fitting and least square \r\nline, numerical differentiation and integration, solution of differential equations and \r\nsystem of linear Algebraic equations, Interpolation and polynomial approximation. \r\nComputer software will be utilized in solving problem assignments","pre_requisite":"Linear Algebra\r\nCalculus II","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"107202","course_name":"Engineering Math","course_description":"In this course, students have the opportunity to be introduced to ordinary differential equations (ODEs) which can be used in many engineering applications. This course also provides an introduction to Laplace transform that may have a useful role in circuit analysis and control. \r\nThere are other important topics covered in this course such as vector analysis and complex calculus which can be used in solving such engineering problems (e.g. fluid mechanics, thermodynamics, etc.).","pre_requisite":"Calculus II ","post_requisite":"Signals and Systems Analysis","course_major":"Networks and Communication Engineering "},
{"course_id":"108103","course_name":"Physics I","course_description":"This course covers: Introduction to the concepts of vectors, motion in one \r\ndimension, motion in two dimensions, Newton's laws of motion, circular motion, \r\nwork and energy, and potential energy","pre_requisite":"None","post_requisite":"Physics I Lab\r\nPhysics II ","course_major":"Networks and Communication Engineering"},
{"course_id":"108104","course_name":"Physics I Lab","course_description":"The experiments in this course serve to reinforce the concepts of mechanics: \r\nkinematics, force, energy, and momentum. In addition, this course aims to \r\nintroduce the basic skills in conducting experiments, handling basic equipment; \r\nand build necessary concepts of data analysis and error correction.","pre_requisite":"Physics I ","post_requisite":"None","course_major":"Networks and Communication Engineering"},
{"course_id":"108203","course_name":"Physics II ","course_description":"This course gives view of electric charge and electric field, Coulomb’s Law, Gauss’s \r\nLaw and its applications, Capacitance and dielectric, Current and Resistance, \r\nOhm’s Law, Direct Current circuits, Kirchhoff’s rules, and Magnetic fields","pre_requisite":"Physics I","post_requisite":"None","course_major":"Networks and Communication Engineering"},
{"course_id":"108204","course_name":"Physics II Lab ","course_description":"The experiments in the course serve to reinforce the concepts of Electric charge, electric field, Coulomb's law, Gauss's law and its applications, Capacitance and dielectric, Current and resistance, Direct current circuits, Magnetic fields, Source of magnetic field and Faraday law. In addition, this course aims to introduce basic skills in conducting experiments, handling basic equipment, and building necessary concepts of data analysis and error correction.","pre_requisite":"Physics II","post_requisite":"None","course_major":"Networks and Communication Engineering "},
{"course_id":"111230","course_name":"Surveying","course_description":"This course introduces This is an introductory course to plane surveying as related to the construction industry. Emphasis is placed on obtaining field skills in linear measurement and the operation of levels, transits, theodolites and total stations.\r\nElevations, horizontal, vertical, and spiral curves are explored.","pre_requisite":"Calculus 2","post_requisite":"Surveying Lab\r\nTransportation Engineering","course_major":"Civil Engineering"},
{"course_id":"111320","course_name":"Geotechnical Engineering","course_description":"Studies physical properties of soils, classification systems, soil structure and soil water systems, effective stress principle and stresses in soil due to applied loads.\r\nIncludes the following topics: compressibility, consolidation and swell; permeability and seepage analysis; soil compaction;","pre_requisite":"Geology\r\nMechanics of Materials","post_requisite":"Geotechnical Engineering Lab\r\nFoundations Engineering","course_major":"Civil Engineering"},
{"course_id":"112200","course_name":"Computer Security Fundamental","course_description":"This course is designed to provide students with a foundational understanding of computer security principles and practices. Covering a broad range of topics, the course aims to equip students with the knowledge and skills necessary to identify, assess, and mitigate security risks in computer systems. Emphasis will be placed on fundamental concepts, best practices, and the importance of a proactive security mindset.","pre_requisite":"Introduction to Programming","post_requisite":"Secure programming \r\nCryptography & Computer Network Security\r\nRisk Assessment & Management \r\nSecure Systems Architectures and Mechanisms\r\nEthical Hacking \r\nCybersecurity Law and Policy","course_major":"Cybersecurity"},
{"course_id":"112201","course_name":"Ethical Hacking","course_description":"This course is designed to provide students with the knowledge and skills necessary to conduct ethical hacking and penetration testing. Students will explore the tools, techniques, and methodologies used by ethical hackers to identify and address vulnerabilities in computer systems and networks. The course emphasizes a hands-on approach, allowing students to gain practical experience in ethical hacking scenarios.","pre_requisite":"Computer Networks\r\nComputer Security Fundamental ","post_requisite":"Intrusion Analysis and Incident Management ","course_major":"Cybersecurity"},
{"course_id":"112300","course_name":"Risk Assessment & Management","course_description":"This course is designed to provide students with a comprehensive understanding of risk assessment and management principles in the context of information security and broader organizational contexts. Students will learn to identify, assess, and manage risks effectively, applying methodologies and tools to safeguard information assets. The course emphasizes the integration of risk management into organizational processes to enhance decision-making and resilience.","pre_requisite":"Computer Security Fundamental ","post_requisite":"None","course_major":"Cybersecurity"},
{"course_id":"112301","course_name":"Cybersecurity Law and Policy","course_description":"This course explores the legal and policy aspects of cybersecurity, focusing on the regulations, standards, and frameworks that govern the protection of information systems and data. Students will gain an understanding of the legal landscape, compliance requirements, and the development of effective cybersecurity policies to mitigate risks and address cyber threats.","pre_requisite":"Computer Security Fundamental ","post_requisite":"None","course_major":"Cybersecurity"},
{"course_id":"112302","course_name":"Computer Forensics","course_description":"This course is designed to introduce students to the field of computer forensics, focusing on the techniques and methodologies used to investigate and analyze digital evidence. Students will learn how to apply forensic tools and procedures to collect, preserve, and analyze data from computer systems, networks, and digital devices. The course covers legal considerations, investigative processes, and the skills necessary to identify and prevent cybercrimes.","pre_requisite":"Foundation of software engineering","post_requisite":"None","course_major":"Cybersecurity"},
{"course_id":"112304","course_name":"Cryptography & Computer Network Security","course_description":"This course combines the study of cryptography with the principles of computer network security, providing students with a comprehensive understanding of securing information in networked environments. The course covers the theoretical foundations of cryptography and its practical applications in ensuring the confidentiality, integrity, and authenticity of data exchanged over computer networks.","pre_requisite":"Computer Networks\r\nComputer Security Fundamental ","post_requisite":"Cyber Warfare","course_major":"Cybersecurity "},
{"course_id":"112306","course_name":"Secure Systems Architectures and Mechanisms","course_description":"This course focuses on the design, implementation, and evaluation of secure systems architectures and mechanisms. Students will explore the principles of secure system design, the integration of security mechanisms, and the application of cryptographic techniques to create robust and resilient systems. The course emphasizes practical approaches to secure systems, considering both hardware and software aspects.","pre_requisite":"Computer Security Fundamental","post_requisite":"None","course_major":"Cybersecurity "},
{"course_id":"112307","course_name":"Intrusion Analysis and Incident Management","course_description":"This course is designed to provide students with the knowledge and skills necessary to analyze and respond to security incidents in computer systems and networks. Students will learn the principles of intrusion detection, incident response, and management. The course covers techniques for identifying, analyzing, and mitigating security incidents, as well as the development of effective incident response plans.","pre_requisite":"Ethical Hacking ","post_requisite":"None","course_major":"Cybersecurity "},
{"course_id":"112311","course_name":"Secure programming","course_description":"This course is designed to provide students with a practical and hands-on approach to secure programming. The focus is on understanding and implementing secure coding practices to develop robust and resilient software applications. Students will learn to identify and mitigate common security vulnerabilities in code, enhancing their ability to create secure software in various programming languages.","pre_requisite":"Data Structures and Algorithms\r\nComputer Security Fundamental","post_requisite":"None","course_major":"Cybersecurity"},
{"course_id":"112401","course_name":"Mobile Applications and Security","course_description":"This course focuses on the development, deployment, and security considerations of mobile applications. Students will learn the principles of mobile application development for various platforms, explore security challenges specific to mobile environments, and gain hands-on experience in securing mobile applications against common threats.","pre_requisite":"Object - Oriented Programming ","post_requisite":"None","course_major":"Computer Science"},
{"course_id":"112403","course_name":"Emerging Technologies IoT and Cloud","course_description":"This course explores the convergence of emerging technologies, specifically focusing on the Internet of Things (IoT) and Cloud Computing. Students will gain a deep understanding of the principles, architectures, and applications of these technologies, as well as their integration to create innovative solutions. The course emphasizes practical hands-on experience, covering the design, implementation, and security considerations associated with IoT and Cloud technologies.","pre_requisite":"Computer Networks ","post_requisite":"None","course_major":"Networks and Communication Engineering"},
{"course_id":"112406","course_name":"Big Data from Social Networks","course_description":"This course delves into the exploration and analysis of big data derived from social networks. Students will learn the fundamentals of big data technologies, data extraction, processing, and analytics applied to social network datasets. The course emphasizes both theoretical understanding and hands-on practical skills required to extract valuable insights from massive social network data.","pre_requisite":"Database Systems","post_requisite":"None","course_major":"Cybersecurity "},
{"course_id":"112407","course_name":"Cyber Warfare","course_description":"This course explores the multifaceted landscape of cyber warfare, covering offensive and defensive strategies, tactics, and technologies employed in the cyber domain. Students will gain an in-depth understanding of the principles of cyber warfare, threat actors and their motivations, as well as the tools and techniques used in both state-sponsored and non-state cyber operations.","pre_requisite":"Cryptography & Computer Network Security ","post_requisite":"None","course_major":"Cybersecurity "},
{"course_id":"112480","course_name":"Cybersecurity Internship","course_description":"This course provides real world experience in Cybersecurity field. The\r\ninternship must be off-campus and students must complete at least one semester \r\nof work consisting of 240 hours or 20 hour work per week\r\n","pre_requisite":">= 75 CR.H.\r\n","post_requisite":"None","course_major":"Cybersecurity"},
{"course_id":"112490","course_name":"Cybersecurity Capstone Project I","course_description":"A project that involves a significant design and implementation, and satisfies AAU senior project requirement and the Cybersecurity design requirement.","pre_requisite":">= 90 CR.H.","post_requisite":"Cybersecurity Capstone Project II","course_major":"Cybersecurity"},
{"course_id":"112491","course_name":"Cybersecurity Capstone Project II","course_description":"A project that involves a significant design and implementation, and satisfies AAU senior project requirement and the Cybersecurity design requirement.","pre_requisite":"Cybersecurity Capstone Project I","post_requisite":"None","course_major":"Cybersecurity"},
{"course_id":"200100","course_name":"Biology","course_description":"The course of biology is designed to give knowledge of the basic processes\r\nof life; function of components of eukaryotic cells, structure of bimolecular,\r\nstructure and function of proteins, membranes and, the role of enzymes.\r\nThe course helps the students to understand cell signaling, DNA replication,\r\nprotein synthesis and, biotechnology techniques.","pre_requisite":"None","post_requisite":"Human Anatomy and Physiology \r\nMicrobiology and immunology ","course_major":"Pharmacy"},
{"course_id":"201100","course_name":"Chemistry","course_description":"The course presents fundamentals of certain topics in chemistry which includes\r\nbasic knowledge of the atom, the electronic structure and configuration of various\r\natoms. It also describes the importance of the periodic table and chemical\r\nbonding. The course details the importance of acids and bases, solutions and\r\nsolubility. The course also includes topics on gases and thermochemistry","pre_requisite":"None","post_requisite":"Pharmaceutical Organic Chemistry - 1\r\n","course_major":"Pharmacy"},
{"course_id":"303100","course_name":"Law and Society","course_description":"This course provides a comprehensive exploration of the intricate relationship between law and society, examining how legal systems shape and are shaped by societal structures, norms, and values. Students will gain an understanding of the foundations of legal systems, the role of law in maintaining order and justice, and the impact of legal decisions on individuals and communities. Through case studies, discussions, and critical analyses, the course aims to equip students with a nuanced understanding of the dynamic interplay between law and society.","pre_requisite":"None","post_requisite":"None","course_major":"Law"},
{"course_id":"401120","course_name":"English 1 ","course_description":"This introductory course is designed to enhance students' communication skills in the English language. Through a comprehensive exploration of fundamental language elements and literary concepts, students will develop their abilities in reading, writing, and critical thinking. The course provides a solid foundation for effective communication, emphasizing clarity, coherence, and creativity in both written and verbal expression.","pre_requisite":"None","post_requisite":"English 2","course_major":"English Language Teaching"},
{"course_id":"401121","course_name":"English 2","course_description":"Building on the foundational skills acquired in English 1, this course delves deeper into advanced aspects of communication and literary analysis. Students will engage with more complex texts, refine their writing style, and further develop critical thinking abilities. The course aims to foster a deeper appreciation for literature while honing advanced communication skills necessary for academic and professional success.","pre_requisite":"English 1 ","post_requisite":"Pronunciation and speech\r\nReading Comprehension\r\nListening and Speaking Skills 1\r\nWriting Skills 1\r\nIntroduction to Literature\r\nBasic Grammar\r\nPhonetics and Phonology 1\r\nIntroduction to Translation","course_major":"English Language Teaching"},
{"course_id":"401212","course_name":"Pronunciation and speech","course_description":"The course aims at developing the students’ pronunciation and at giving them the opportunity to practice listening to speech at conversational speed and in a variety of English accents. The focus is primarily on improving features of pronunciation that are particularly relevant to understanding English and to developing fluency.","pre_requisite":"English 2 ","post_requisite":"None ","course_major":"Arts in English Language and Translation"},
{"course_id":"401224","course_name":"Writing Skills 2","course_description":"This course is the second course in the writing course sequence. It integrates\r\nthe methods learnt by students in Writing I with more complex writing strategies\r\nso as to give students a solid grounding in writing techniques and skills.","pre_requisite":"Writing Skills 1","post_requisite":"Introduction to Linguistics","course_major":"Arts in English Language and Translation"},
{"course_id":"401337","course_name":"Translation of English Texts","course_description":"This course introduces the basic techniques of English-Arabic translation, the field of translation, the skills necessary to work as a successful translator and the process and quality of translation with emphasis on the differences in the two cultures. It requires practical tasks that involve translation from English into Arabic. Exercises will provide translation practice with different types of texts","pre_requisite":"Introduction to Translation","post_requisite":"Translation Theory","course_major":"Arts in English Language and Translation"},
{"course_id":"401340","course_name":"Translation Theory","course_description":"This course provides a conceptual map of translation studies and outlines\r\nthe various theoretical approaches and trends that impact the practice of\r\ntranslation. It also introduces the range of factors that govern the process of\r\ntranslation and the theoretical underpinnings that have motivated different attitudes to translating and translations.","pre_requisite":"Translation of English Texts","post_requisite":"None","course_major":"Arts in English Language and Translation"},
{"course_id":"403226","course_name":"Learning Difficulties","course_description":"This course aims to describe the historical development of learning disabilities, as well as identifies their different classification types, and causes.","pre_requisite":"Introduction to Special Education","post_requisite":"None ","course_major":"Education in Special Education"},
{"course_id":"403233","course_name":"Behavioral and Emotional Disorders","course_description":"This course aims to identify common behavioral disorders that may exist\r\namong school children and how to identify the causes and characteristics of\r\nstudents who suffer from these disorders","pre_requisite":"Introduction to Special Education","post_requisite":"None ","course_major":"Education in Special Education"},
{"course_id":"403239","course_name":"Autism Spectrum Disorder","course_description":"This course aims to identify autism spectrum disorder in terms of its\r\nfoundations, its definition, classification and the history of interest in it in\r\nterms of scientific documentation of this disorder. This course also aims to\r\nidentify the causes of autism, its prevalence rate, and the characteristics\r\nof individuals who suffer from this disorder in various aspects. ","pre_requisite":"Introduction to Special Education","post_requisite":"None ","course_major":"Education in Special Education"},
{"course_id":"405100","course_name":"Arabic Language","course_description":"This introductory course aims to provide students with a strong foundation in the Arabic language, focusing on essential communication skills in both written and spoken forms. Through a comprehensive exploration of Arabic grammar, vocabulary, and cultural nuances, students will develop the ability to engage in basic conversations, read simple texts, and write coherent expressions in Arabic.","pre_requisite":"None","post_requisite":"None","course_major":"Arabic Language and Literature"},
{"course_id":"406100","course_name":"Arabs and Muslims Contributions to Arts and Science","course_description":"This course explores the rich and often overlooked contributions of Arabs and Muslims to the realms of arts and sciences throughout history. Students will embark on a fascinating journey that spans centuries, examining the pivotal role played by Arab and Muslim scholars, scientists, and artists in shaping the global landscape of knowledge and creativity. The course aims to illuminate the diverse cultural and intellectual heritage that has profoundly influenced human civilization.","pre_requisite":"None","post_requisite":"None","course_major":"Islamic Studies"},
{"course_id":"406110","course_name":"Islamic Culture","course_description":"This course provides a comprehensive exploration of Islamic culture, offering students an in-depth understanding of the rich tapestry of traditions, values, and customs that characterize Islamic societies. Students will delve into the historical, artistic, and social aspects of Islamic culture, fostering an appreciation for the diversity within the global Muslim community.","pre_requisite":"None","post_requisite":"None","course_major":"Islamic Studies"},
{"course_id":"408100","course_name":"Introduction to Psychology","course_description":"This introductory course provides students with a foundational understanding of the principles and concepts that form the basis of psychology. Students will explore the diverse aspects of human behavior, cognition, and emotion, gaining insight into the methods used to study and understand the mind. Through a combination of theoretical learning and practical applications, this course serves as a gateway to the captivating world of psychology.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Psychology"},
{"course_id":"408101","course_name":"Physical Education & Health","course_description":"This comprehensive course integrates physical education and health, providing students with a holistic understanding of the importance of an active and healthy lifestyle. Through a combination of theoretical knowledge and practical application, students will explore the principles of physical fitness, nutrition, mental well-being, and the overall promotion of a healthy lifestyle. The course aims to empower students to make informed choices that contribute to their well-being and lifelong health.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Psychology"},
{"course_id":"408103","course_name":"Thinking Skills","course_description":"This course is designed to enhance students' critical thinking and problem-solving abilities by providing a structured exploration of various thinking skills and strategies. Through interactive activities, case studies, and real-world applications, students will develop the skills necessary for effective decision-making, creative problem-solving, and sound reasoning. The course aims to empower students to approach challenges with confidence and think strategically across various disciplines.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Psychology"},
{"course_id":"408104","course_name":"Self Assessment","course_description":"This course focuses on guiding individuals through a process of self-assessment, providing tools and strategies for personal reflection and growth. Students will explore various dimensions of self-awareness, including strengths, values, interests, and personal goals. Through interactive exercises, journaling, and discussions, the course aims to empower individuals to gain a deeper understanding of themselves, make informed life choices, and embark on a journey of continuous self-improvement.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Psychology"},
{"course_id":"409100","course_name":"Ethical Awareness","course_description":"This course focuses on cultivating ethical awareness and fostering a deep understanding of ethical principles in various contexts. Students will explore fundamental ethical theories, real-world applications of ethics, and the development of critical thinking skills to navigate complex moral dilemmas. Through engaging discussions, case studies, and reflective activities, the course aims to empower students to make ethical decisions in both personal and professional settings.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Sociology"},
{"course_id":"409102","course_name":"Environmental Awareness","course_description":"This course provides a comprehensive exploration of environmental issues, fostering awareness, and understanding of the interconnectedness between human activities and the natural world. Students will examine the challenges facing the environment, the impact of human behavior, and the importance of sustainable practices. Through a combination of scientific knowledge, case studies, and practical solutions, the course aims to empower students to become environmentally conscious individuals capable of contributing to positive change.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Sociology\r\n"},
{"course_id":"409103","course_name":"UAE Studies","course_description":"This course provides an in-depth exploration of the United Arab Emirates (UAE), combining historical insights with an examination of contemporary developments. Students will gain a comprehensive understanding of the cultural, social, economic, and political aspects that shape the UAE's identity. The course aims to foster a deep appreciation for the unique blend of tradition and modernity within the UAE.","pre_requisite":"None","post_requisite":"None","course_major":"Applied Sociology"},
{"course_id":"501100","course_name":"Introduction to Time Management","course_description":"This course introduces the various concepts of Time Management that combine values, relaxation, time management,\r\nand mental rehearsal to develop personal productivity and balance in life. This Course allows the individual to develop\r\nphysically, emotionally, and mentally, leading to better relationships, more effective work practices, and clarity of\r\npurpose.","pre_requisite":"None","post_requisite":"None","course_major":"Management"},
{"course_id":"501150","course_name":"Leadership and Teamwork","course_description":"This course is designed to develop students' leadership and teamwork skills, emphasizing the importance of effective collaboration and leading others towards common goals. Through experiential learning, case studies, and practical exercises, students will explore leadership theories, communication strategies, and the dynamics of effective team interactions. The course aims to empower individuals to lead with integrity, inspire teamwork, and foster a positive and productive work environment.","pre_requisite":"None","post_requisite":"None","course_major":"Management"},
{"course_id":"501170","course_name":"Fundamentals to Innovation and Entrepreneurship","course_description":"This course involves a rigorous innovation and entrepreneurship treatment appropriate for undergraduate students to\r\nunderstand contemporary business challenges. It focuses on learning about the creative mindset of students enabling\r\ninnovation and entrepreneurial ventures, and explores further where the innovative and entrepreneurial ideas come\r\nfrom. The course also explores how to distinguish between an idea and an attractive opportunity to start with and then\r\nincubate and let it grow into a high-impact enterprise and finally, the course discusses the methods and tools that can\r\nbe used when and where the opportunities are identified. The course concludes with a project that allows students to\r\napply the lessons learned in class by writing a business plan","pre_requisite":"None","post_requisite":"None","course_major":"Management"},
{"course_id":"502200","course_name":"Principles of Financial Accounting","course_description":"This course introduces the subject of accounting under the International Financial Reporting Standards (IFRS) as a business\r\nlanguage for beginning accounting students and is appropriate for undergraduate students at their first and second-year levels.\r\nThe course explains the importance of accounting at individual and business levels. It includes topics such as accounting\r\nequation, accounting cycle, financial statements, recording & reporting accounting information, and interpretation of financial\r\ndata for decision making.","pre_requisite":"None","post_requisite":"None","course_major":"Accounting"},
{"course_id":"504450","course_name":"Marketing Research","course_description":"This course emphasizes that in modern organizations, marketing research is considered to perform a pervasive\r\nimperative function, mainly when organizations are constantly racing to satisfy their customers in today’s\r\nfiercely competitive environment and given the fact that organizations barely satisfy customers fully if they do\r\nnot know what the customers desire for","pre_requisite":"Statistics for Business Decision-Making\r\nConsumer Behavior","post_requisite":"Strategic Marketing Management","course_major":"Marketing"},
{"course_id":"504460","course_name":"Service Marketing","course_description":"This course discusses various aspects and challenges of service marketing, particularly when services dominate\r\nthe global economy and are becoming critical for competitive advantage in companies across the globe, and all\r\nindustry sectors, particularly in the Gulf region. Hence, this course entails the notion that service management\r\npresents unique challenges reflecting the fundamental differences between products and services. This course\r\ndeciphers the complexity involved in successfully managing the above challenges through threading together\r\nthe functional disciplines of marketing, operations, and human resources.","pre_requisite":"Principles of Marketing Management","post_requisite":"None ","course_major":"Marketing"},
{"course_id":"505320","course_name":"International HRM","course_description":"This course presents international human resource management (IHRM) as the interplay among the three dimensions of human resource activities, type of employees, and countries of operation. It examines the cultural and organizational contexts of IHRM in cross-border mergers and acquisitions, international alliances, and SMEs","pre_requisite":"Human Resource Management","post_requisite":"HRM in Virtual Organizations","course_major":"Human Resource Management"},
{"course_id":"505322","course_name":"Managing Conflicts","course_description":"The course provides an overview of the employment relationship involving interactions, behaviors, conflicts, and outcomes in the workplace. It pays close attention to the current themes, trends and developments in employment relations, and the regulatory landscape. ","pre_requisite":"Organizational Behavior","post_requisite":"None ","course_major":"Human Resource Management"},
{"course_id":"506200","course_name":"Principles of MIS\r\n","course_description":"This course is designed for business students who will soon become professionals in a fast, dynamic, demanding business\r\nenvironment. It concentrates on using and managing information technologies to enable organizations to gain a competitive\r\nadvantage in the ever-demanding global market","pre_requisite":"Computer Skills","post_requisite":"Introduction to Programming Languages\t\r\nDatabase Management principles and Applications\r\nBusiness System Analysis and Applications\r\nBusiness Intelligence\r\nE–Business\r\nDecision Support Systems\r\nKnowledge Management","course_major":"Management Information Systems"},
{"course_id":"506330","course_name":"Business System Analysis and Applications","course_description":"The course aims to provide a foundation in traditional structured analysis and design techniques, with an introduction to object-oriented and UML-based analysis and design techniques that are increasingly used today","pre_requisite":"Principles of MIS","post_requisite":"Project Management","course_major":"Management Information Systems"},
{"course_id":"508203","course_name":"Scientific Research Methodology","course_description":"The course provides a comprehensive introduction to writing a research proposal. It examines all phases of the \r\nresearch process, starting with identifying a topic, formulating hypotheses, methodology selection, literature \r\nreview, data collection, analysis, and finally, preparing a final research document.","pre_requisite":"None","post_requisite":"None","course_major":"Finance & Banking"},
{"course_id":"509210","course_name":"Principles of Microeconomics","course_description":"Principles of Microeconomics is an introductory course designed to provide students with a foundational understanding of the fundamental concepts that govern individual economic decision-making. The course explores the microeconomic principles that shape how consumers, businesses, and industries interact within markets. ","pre_requisite":"None","post_requisite":"None","course_major":"Finance & Banking"},
{"course_id":"701120","course_name":"Fundamentals of Nutrition","course_description":"This course is a preface to food and nutrition as a healthy life style component as well as acknowledges the student about the basic principles of essential nutrients, including, their sources, absorption, functions, and their requirements. Issues of food safety as part of nutritional concern will also be exposed.","pre_requisite":"Food Microbiology","post_requisite":"Nutrition in Life Span\r\nBasics of Food Science\r\nFood Production & Preparation\r\nMenu planning","course_major":"Nutrition and Dietetics"},
{"course_id":"701220","course_name":"Nutrition in Life Span","course_description":"Principles of nutrition applied to meeting dietary needs of individuals throughout their life cycle. Study of relationship among nutrition, growth, development, and maturity Nutrition and Dietetics emphasis on physical and psychosocial considerations affecting food intake\r\n","pre_requisite":"Fundamentals of Nutrition","post_requisite":"None ","course_major":"Nutrition and Dietetics"}
]
}
]
